app/views/salidas/_form.html.erb

    <%= f.label :articulo %>
    <%= collection_select(:salidas, :articulo, Producto.all, :departur, :articulo)%>
---
SELECT "productos".* FROM "productos"