app/controllers/productos_controller.rb

  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("articulo", "existencia", "stockmin", "stockmax", "disponibles", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["articulo", "anticongelante"], ["existencia", 111], ["stockmin", 123], ["stockmax", 123], ["disponibles", "si"], ["created_at", 2016-07-01 18:07:06 UTC], ["updated_at", 2016-07-01 18:07:06 UTC]]

  def update
    respond_to do |format|
      if @producto.update(producto_params)
---
UPDATE "productos" SET "existencia" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["existencia", 78], ["updated_at", 2016-07-23 14:27:03 UTC], ["id", 1]]

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]