app/controllers/salidas_controller.rb

SELECT "salidas".* FROM "salidas"
---
  def index
    @salidas = Salida.all

INSERT INTO "salidas" ("fecha", "numero", "piezas", "solicita", "autoriza", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fecha", Thu, 21 Jul 2016], ["numero", 1], ["piezas", 11], ["solicita", "11"], ["autoriza", "11"], ["created_at", 2016-07-21 20:12:05 UTC], ["updated_at", 2016-07-21 20:12:05 UTC]]
---
  def create
    @salida = Salida.new(salida_params)

    respond_to do |format|
      if @salida.save

DELETE FROM "salidas" WHERE "salidas"."id" = ?  [["id", 1]]
---
  def destroy
    @salida.destroy

SELECT  "salidas".* FROM "salidas" WHERE "salidas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_salida
      @salida = Salida.find(params[:id])